20240929171934-portfolio_7.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-29 Sun 23:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Portfolio 7</title>
<meta name="author" content="chameko" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="imagine.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Portfolio 7</h1>
<p>
One of the problems I didn't expect to encounter while working on this project was programming. I am confident in my knowledge of computers and general programming languages as picked up python relatively easily due to its easy to approach nature. However one of the difficulties I encountered was setting up a working python environment, especially for machine learning. The primary libraries I'm interested in are PyTorch, which is an library for AI development and PyTorch Geometric, which is specifically for graph based neural networks. I have two computers of which I set up the environments. One is my low power linux laptop, and the other is my desktop that has a powerful GPU which I plan to use to test and train the model. To setup on my laptop I had to learn about python's virtual environments as the global environment was managed by my laptops package manager. For my desktop I learned that in machine learning, NVIDIA is the provider of choice for GPU based acceleration using the cuda platform, which places my AMD 6800XT at a disadvantage in terms of training support and stability. Given I will likely want to rapidly iterate I am starting to look at options that will give me access to more compute power.
</p>

<p>
I ran a simple test neural network to verify the environment, the code of which can be found at <a href="20240924185947-pytorch_gnn_basics.html#ID-f7d3615d-a80d-4e25-9eb4-d8939a7eb197">Pytorch GNN basics</a>.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: chameko</p>
<p class="date">Created: 2024-09-29 Sun 23:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
